# SpanDirectionAngle Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Floor..::..SpanDirectionAngle Property
Floor Class See Also
---
Retrieve the span direction angle of the floor.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double SpanDirectionAngle { get; set; }
```

Visual Basic
---
```text
Public Property SpanDirectionAngle As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double SpanDirectionAngle {
	double get ();
	void set (double value);
}
```

# Remarks
The angle returned is in radians. An exception will be thrown if the floor is non structural.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: |

# See Also
Floor Class
Autodesk.Revit.DB Namespace